* Workspace

** DONE [#B]kill the bug in org agenda 
   CLOSED: [2017-11-23 Thu 14:51] SCHEDULED: <2017-11-23 Thu 21:20>

** DONE [#B] finish software homework  
   CLOSED: [2017-11-24 Fri 11:40] SCHEDULED: <2017-11-23 Thu 21:30>
   
** DONE [#B]  make Russia(elective course) PPT
   CLOSED: [2017-11-27 Mon 12:57] SCHEDULED: <2017-11-25 Sat>
** DONE [#B] complete RequestAnalyse Document
   SCHEDULED: <2017-11-17 Fri 16:00>

** DONE [#B] config software test environment
   SCHEDULED: <2017-11-19 Sun 20:30>

** DONE [#B] backup vim emacs ubuntu config
   SCHEDULED: <2017-11-19 Sun 21:57>

** DONE [#B] hacking chinanet 
   SCHEDULED: <2017-11-20 Mon 19:00>

** DONE [#B] finish compilation principle 
   CLOSED: [2017-11-27 Mon 21:30] SCHEDULED: <2017-11-27 Mon 19:00>
   :LOGBOOK:
   CLOCK: [2017-11-27 Mon 20:52]--[2017-11-27 Mon 21:17] =>  0:25
   CLOCK: [2017-11-27 Mon 20:20]--[2017-11-27 Mon 20:45] =>  0:25
   CLOCK: [2017-11-27 Mon 19:48]--[2017-11-27 Mon 20:13] =>  0:25
   CLOCK: [2017-11-27 Mon 19:07]--[2017-11-27 Mon 19:32] =>  0:25
   :END:
   
** DONE [#B] work on presentation 
   CLOSED: [2017-11-27 Mon 21:56] SCHEDULED: <2017-11-27 Mon 21:32>
   :LOGBOOK:
   CLOCK: [2017-11-27 Mon 21:32]--[2017-11-27 Mon 21:56] =>  0:24
   :END:

** DONE [#B] fix agenda bug 
   CLOSED: [2017-11-29 Wed 10:35]

** DONE [#B]learn org mode                                            :study:
   CLOSED: [2017-11-29 Wed 18:13] SCHEDULED: <2017-11-29 Wed>

** TODO [#B] learn emacs by watcing videos                           :study:
   :PROPERTIES:
   :LAST_REPEAT: [2017-12-08 Fri 12:51]
   :END:
   - State "DONE"       from "TODO"       [2017-12-08 Fri 12:51]
   :LOGBOOK:
   CLOCK: [2017-12-09 Sat 17:21]--[2017-12-09 Sat 18:28] =>  1:07
   CLOCK: [2017-12-08 Fri 10:51]--[2017-12-08 Fri 11:35] =>  0:44
   :END:
   - State "DONE"       from "TODO"       [2017-12-06 Wed 09:51]
   - State "DONE"       from "TODO"       [2017-12-04 Mon 11:46]
   - State "DONE"       from "TODO"       [2017-12-03 Sun 08:00]
   - State "DONE"       from "TODO"       [2017-12-01 Fri 09:43]
   - State "DONE"       from "TODO"       [2017-11-30 Thu 21:58]
   - State "DONE"       from "TODO"       [2017-11-29 Wed 19:14]
  http://v.youku.com/v_show/id_XMTM2MjM5OTU5Ng==.html?spm=a2h1n.8251843.playList.5!4~5~A&f=26137579&o=1

** DONE [#A]complete compilation principle homework 
   CLOSED: [2017-11-29 Wed 19:14] SCHEDULED: <2017-11-29 Wed 18:30>

** DONE [#A] try my best to install nodejs,npm,hexo,make preparations for blog. 
   CLOSED: [2017-11-29 Wed 22:11] SCHEDULED: <2017-11-29 Wed 21:00>

** DONE [#A] modify blog contents 
   CLOSED: [2017-11-30 Thu 22:53] SCHEDULED: <2017-11-30 Thu 22:30>

** DONE [#A] review book for forthcoming Software Project exam  
   CLOSED: [2017-12-03 Sun 14:13] SCHEDULED: <2017-12-02 Sat 20:30>
   :LOGBOOK:
   CLOCK: [2017-12-10 Sun 15:22]--[2017-12-10 Sun 17:11] =>  1:49
   :END:

   - Note taken on [2017-12-02 Sat 17:10] \\
     test 2017-11-23
   - Note taken on [2017-12-02 Sat 16:54] \\
     hello

** DONE [#B] watch mayuan course on mooc net 
   CLOSED: [2017-12-04 Mon 20:45] SCHEDULED: <2017-12-04 Mon 19:00>

** DONE [#B] finish software test experiment document 
   CLOSED: [2017-12-05 Tue 15:26] SCHEDULED: <2017-12-05 Tue 13:00>
   :LOGBOOK:
   CLOCK: [2017-12-05 Tue 14:41]--[2017-12-05 Tue 15:06] =>  0:25
   CLOCK: [2017-12-05 Tue 14:06]--[2017-12-05 Tue 14:31] =>  0:25
   CLOCK: [2017-12-05 Tue 13:41]--[2017-12-05 Tue 14:06] =>  0:25
   :END:

** TODO [#B] install java develop toolkit                              :temp:

** [#B] complete model constrution                                    :work:
   SCHEDULED: <2017-12-02 Sat> DEADLINE: <2017-12-15 Fri>
   :LOGBOOK:
   CLOCK: [2017-12-08 Fri 19:22]--[2017-12-08 Fri 20:38] =>  1:40
   CLOCK: [2017-12-08 Fri 18:49]--[2017-12-08 Fri 18:58] =>  0:09
   CLOCK: [2017-12-06 Wed 20:42]--[2017-12-06 Wed 21:03] =>  0:21
   CLOCK: [2017-12-06 Wed 20:12]--[2017-12-06 Wed 20:37] =>  0:25
   CLOCK: [2017-12-06 Wed 19:36]--[2017-12-06 Wed 20:12] =>  0:36
   CLOCK: [2017-12-06 Wed 18:33]--[2017-12-06 Wed 18:58] =>  0:25
   CLOCK: [2017-12-06 Wed 18:03]--[2017-12-06 Wed 18:28] =>  0:25
   CLOCK: [2017-12-06 Wed 17:01]--[2017-12-06 Wed 17:26] =>  0:25
   CLOCK: [2017-12-06 Wed 16:08]--[2017-12-06 Wed 16:33] =>  0:25
   :END:

** TODO [#B] watch teleplay by Huge                                    :life:
- Note taken on [2017-12-10 Sun 13:34] \\
  finish 52
   - Note taken on [2017-12-08 Fri 13:26] \\
     finish 48
   - Note taken on [2017-12-08 Fri 10:47] \\
     finish 46
   :LOGBOOK:
   CLOCK: [2017-12-10 Sun 12:13]--[2017-12-10 Sun 12:53] =>  0:40
   CLOCK: [2017-12-10 Sun 11:05]--[2017-12-10 Sun 11:41] =>  0:36
   CLOCK: [2017-12-09 Sat 12:06]--[2017-12-09 Sat 13:40] =>  1:34
   CLOCK: [2017-12-08 Fri 12:13]--[2017-12-08 Fri 13:26] =>  1:13
   CLOCK: [2017-12-08 Fri 10:06]--[2017-12-08 Fri 10:47] =>  0:41
   CLOCK: [2017-12-07 Thu 22:08]--[2017-12-07 Thu 22:50] =>  0:42
   :END:

** DONE [#B] learn emacs tutorials                                   :study:
   CLOSED: [2017-12-08 Fri 14:56]
   :LOGBOOK:
   CLOCK: [2017-12-08 Fri 14:16]--[2017-12-08 Fri 14:56] =>  0:40
   :END:

** [#B] watch movies                                                   :life:
   :LOGBOOK:
   CLOCK: [2017-12-08 Fri 18:58]--[2017-12-08 Fri 19:17] =>  0:19
   CLOCK: [2017-12-08 Fri 17:40]--[2017-12-08 Fri 18:49] =>  1:09
   :END:
daily life activities

** DONE [#B] go for a date and a good night
   SCHEDULED: <2017-11-18 Sat>
* life


* Weekly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thisweek :fileskip0 t :indent t
#+CAPTION: Clock summary at [2017-12-10 Sun 15:22], for week 2017-W49.
| File       | Headline                                     | Time    |      |
|------------+----------------------------------------------+---------+------|
|            | ALL *Total time*                             | *19:04* |      |
|------------+----------------------------------------------+---------+------|
| career.org | *File time*                                  | *3:57*  |      |
|            | Learn Emacs                                  | 3:57    |      |
|            | \_  learn elisp                              |         | 3:57 |
|------------+----------------------------------------------+---------+------|
| gtd.org    | *File time*                                  | *15:07* |      |
|            | Workspace                                    | 15:07   |      |
|            | \_  learn emacs by watcing videos            |         | 1:51 |
|            | \_  finish software test experiment document |         | 1:15 |
|            | \_  complete model constrution               |         | 4:27 |
|            | \_  watch teleplay by Huge                   |         | 5:26 |
|            | \_  learn emacs tutorials                    |         | 0:40 |
|            | \_  watch movies                             |         | 1:28 |
#+END:
#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'thisweek nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC
* Monthly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thismonth :fileskip0 t :indent t
#+CAPTION: Clock summary at [2017-12-10 Sun 10:59], for December 2017.
| File       | Headline                                     | Time    |      |
|------------+----------------------------------------------+---------+------|
|            | ALL *Total time*                             | *19:03* |      |
|------------+----------------------------------------------+---------+------|
| career.org | *File time*                                  | *5:12*  |      |
|            | Learn Emacs                                  | 5:12    |      |
|            | \_  learn elisp                              |         | 5:12 |
|------------+----------------------------------------------+---------+------|
| gtd.org    | *File time*                                  | *13:51* |      |
|            | Workspace                                    | 13:51   |      |
|            | \_  learn emacs by watcing videos            |         | 1:51 |
|            | \_  finish software test experiment document |         | 1:15 |
|            | \_  complete model constrution               |         | 4:27 |
|            | \_  watch teleplay by Huge                   |         | 4:10 |
|            | \_  learn emacs tutorials                    |         | 0:40 |
|            | \_  watch movies                             |         | 1:28 |
#+END:
#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'thisweek nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

